[
  {
    "id": 1,
    "name": "Horiseon",
    "image": "./assets/images/Horiseon.png",
    "Project description": "In this project HTML and CSS code was refactored for an organisation called Horiseon\n to improve the accessibilty standards of their static home page.",
    "github": "",
    "deployed": ""
  },
  {
    "id": 2,
    "name": "Password Generator",
    "image": "./assets/images/PasswordGenerator.png",
    "Project description": "In this project javascript was used to create an application for employees to generate random passwords based on selected criteria. The app will run in browser to display the randomly generated password.",
    "github": "",
    "deployed": ""
  },
  {
    "id": 3,
    "name": "Coding Quiz",
    "image": "./assets/images/CodingQuiz.png",
    "Project description": "In this project javascript was used to manipulate the DOM (Document Object Model) to create a coding quiz. the browsers local storage was used to keep track of the scores and log them to the highscores page. ",
    "github": "",
    "deployed": "deployed"
  },
  {
    "id": 4,
    "name": "Work Day Scheduler",
    "image": "./assets/images/WorkDayScheduler.png",
    "Project description": "This project contains a work day scheduler devleoped utitlising the third party API JQuery and the moment JS libraray. The scheduler contains 1 hour timeblocks satring from 9AM and ending ant 5PM. The colour coded time blocks can be edited and saved to keep a record of your daily tasks.",
    "github": "",
    "deployed": "deployed"
  },
  {
    "id": 5,
    "name": "Weather Dashboard",
    "image": "./assets/images/WeatherDashboard.png",
    "Project description": "This project is a repsonsive weather app designed to be viewed within your browser on your mobile phone or PC. The required data for this application was provided by the Open-Weather API and requested using AJAX ",
    "github": "",
    "deployed": "deployed"
  },
  {
    "id": 6,
    "name": "Eco Travel Planner",
    "image": "./assets/images/EcoTravelPlanner.png",
    "Project description": "We created an application to help travelers who are environmentally conscious and want to minimize their carbon footprint. The app helps travelers find and book eco-friendly accommodations and provides information about sustainable travel options such as hike and bike trails in searched cities.",
    "github": "",
    "deployed": ""
  }
]
